In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("https://gist.githubusercontent.com/jwalsh/ce1dc0436aba5b7a5c9666f47fa5a380/raw/5ce3854392b43ff97907112d344fc008229b0445/titanic.csv")

df

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,Pears,Mrs. Thomas (Edith Wearne),female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,Meo,Mr. Alfonzo,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,van Billiard,Mr. Austin Blyler,male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,Olsen,Mr. Ole Martin,male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,Williams,Mr. Charles Duane,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [10]:
# 
s = df['Name'][0:7]
s

0                                Mr. Owen Harris
1     Mrs. John Bradley (Florence Briggs Thayer)
2                                    Miss. Laina
3             Mrs. Jacques Heath (Lily May Peel)
4                              Mr. William Henry
5                                      Mr. James
6                                  Mr. Timothy J
Name: Name, dtype: object

In [11]:
type(s)

pandas.core.series.Series

In [20]:
# customized the index
# create the new index
# Note: element in l equal to s index(7)
l = ['a','v','d','r','s','e','r']
pd.Series(s,index = l)

a    NaN
v    NaN
d    NaN
r    NaN
s    NaN
e    NaN
r    NaN
Name: Name, dtype: object

In [21]:
s1 = pd.Series(list(s), index = l)
s1

a                                Mr. Owen Harris
v     Mrs. John Bradley (Florence Briggs Thayer)
d                                    Miss. Laina
r             Mrs. Jacques Heath (Lily May Peel)
s                              Mr. William Henry
e                                      Mr. James
r                                  Mr. Timothy J
dtype: object

In [22]:
s[0]

' Mr. Owen Harris'

In [23]:
# s[0] == s[1] == s1['a'] because internal(default) data not change
s1[0]

' Mr. Owen Harris'

In [24]:
s1['a']

' Mr. Owen Harris'

In [37]:
s2 = s.append(s1)

C:\Users\hp\AppData\Local\Temp\ipykernel_1868\3943142441.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s2 = s.append(s1)

In [38]:
s2

0                                Mr. Owen Harris
1     Mrs. John Bradley (Florence Briggs Thayer)
2                                    Miss. Laina
3             Mrs. Jacques Heath (Lily May Peel)
4                              Mr. William Henry
5                                      Mr. James
6                                  Mr. Timothy J
a                                Mr. Owen Harris
v     Mrs. John Bradley (Florence Briggs Thayer)
d                                    Miss. Laina
r             Mrs. Jacques Heath (Lily May Peel)
s                              Mr. William Henry
e                                      Mr. James
r                                  Mr. Timothy J
dtype: object

In [33]:
# it gives data ,which index value equal to 2
s2[2]

' Miss. Laina'

In [31]:
# in case of slicing it takes default data
s2[2:5]

2                            Miss. Laina
3     Mrs. Jacques Heath (Lily May Peel)
4                      Mr. William Henry
dtype: object

In [34]:
s2[2:]

2                                    Miss. Laina
3             Mrs. Jacques Heath (Lily May Peel)
4                              Mr. William Henry
5                                      Mr. James
6                                  Mr. Timothy J
a                                Mr. Owen Harris
v     Mrs. John Bradley (Florence Briggs Thayer)
d                                    Miss. Laina
r             Mrs. Jacques Heath (Lily May Peel)
s                              Mr. William Henry
e                                      Mr. James
r                                  Mr. Timothy J
dtype: object

In [54]:
s4 = pd.Series([3,4,5,6,6] , index=[2,4,5,6,1])
s5 = pd.Series([34,345,45,45,454] , index=[9,4,5,6,7])
s6 = s4.append(s5)
s6

C:\Users\hp\AppData\Local\Temp\ipykernel_1868\2741830945.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s6 = s4.append(s5)

2      3
4      4
5      5
6      6
1      6
9     34
4    345
5     45
6     45
7    454
dtype: int64

In [55]:
s6[4]

4      4
4    345
dtype: int64

In [56]:
# slicing
s6[1:2]

4    4
dtype: int64

In [57]:
s4

2    3
4    4
5    5
6    6
1    6
dtype: int64

In [58]:
s5

9     34
4    345
5     45
6     45
7    454
dtype: int64

In [59]:
# multipication based on name index
# ex:index 1 avaible in s4  but not in s5. So the result is NaN
# ex2: index 4 avaible in both s4 and s5. result is 45*5=225
s4*s5

1       NaN
2       NaN
4    1380.0
5     225.0
6     270.0
7       NaN
9       NaN
dtype: float64

In [60]:
# addition based on index
s4+s5

1      NaN
2      NaN
4    349.0
5     50.0
6     51.0
7      NaN
9      NaN
dtype: float64